#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with module.s3_website.aws_s3_bucket.website_bucket,
  on modules/s3_website/main.tf line 6, in resource "aws_s3_bucket" "website_bucket":
   6: resource "aws_s3_bucket" "website_bucket" {

Use the aws_s3_bucket_website_configuration resource instead

(and 2 more similar warnings elsewhere)

Warning: Deprecated Resource

  with module.s3_website.aws_s3_bucket_object.index,
  on modules/s3_website/main.tf line 15, in resource "aws_s3_bucket_object" "index":
  15: resource "aws_s3_bucket_object" "index" {

use the aws_s3_object resource instead

(and one more similar warning elsewhere)

Warning: Deprecated attribute

  on modules/s3_website/outputs.tf line 6, in output "website_url":
   6:   value       = aws_s3_bucket.website_bucket.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_sms.data.archive_file.lambda_zip: Reading...
module.lambda_email.data.archive_file.lambda_zip: Reading...
module.lambda_sms.data.archive_file.lambda_zip: Read complete after 0s [id=32fb6fc8aa724c7408f68078ecb764ff60b1d88a]
module.lambda_push.data.archive_file.lambda_zip: Reading...
module.lambda_email.data.archive_file.lambda_zip: Read complete after 0s [id=aca9b8730a3771d263390db2f86fb9b825195bc2]
module.lambda_push.data.archive_file.lambda_zip: Read complete after 0s [id=cf90aa5523c4458d7a7168027c795780e0f378b1]
module.api_gateway.aws_api_gateway_rest_api.notification_api: Refreshing state... [id=4ml0u9l3pg]
module.sns.aws_sns_topic.push_topic: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-push-topic]
module.sns.aws_sns_topic.sms_topic: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-sms-topic]
module.sns.aws_sns_topic.email_topic: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-email-topic]
module.s3_website.aws_s3_bucket.website_bucket: Refreshing state... [id=aws-notification-platform-dev-website]
module.iam.aws_iam_policy_attachment.lambda_basic_execution: Refreshing state... [id=aws-notification-platform-dev-lambda-basic-execution]
module.iam.aws_iam_role.lambda_role: Refreshing state... [id=aws-notification-platform-dev-lambda-role]
module.lambda_push.aws_lambda_function.push_lambda: Refreshing state... [id=aws-notification-platform-dev-push]
module.lambda_email.aws_lambda_function.email_lambda: Refreshing state... [id=aws-notification-platform-dev-email]
module.lambda_sms.aws_lambda_function.sms_lambda: Refreshing state... [id=aws-notification-platform-dev-sms]
module.api_gateway.aws_api_gateway_resource.send_push: Refreshing state... [id=vtykov]
module.api_gateway.aws_api_gateway_resource.send_sms: Refreshing state... [id=rvbz48]
module.api_gateway.aws_api_gateway_resource.send_email: Refreshing state... [id=066h1y]
module.api_gateway.aws_api_gateway_method.post_send_sms: Refreshing state... [id=agm-4ml0u9l3pg-rvbz48-POST]
module.api_gateway.aws_api_gateway_method.post_send_push: Refreshing state... [id=agm-4ml0u9l3pg-vtykov-POST]
module.api_gateway.aws_api_gateway_method.post_send_email: Refreshing state... [id=agm-4ml0u9l3pg-066h1y-POST]
module.sns.aws_sns_topic_subscription.sms_lambda_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-sms-topic:c8a8c98f-3c4d-47f4-90d3-6743501d732c]
module.sns.aws_sns_topic_subscription.email_lambda_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-email-topic:6b56a09b-f430-43c1-a0f2-c2951ed11f85]
module.sns.aws_sns_topic_subscription.push_lambda_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-push-topic:aba8dbb0-18c0-48ee-be68-37d1e1f17197]
module.s3_website.aws_s3_bucket_object.error: Refreshing state... [id=error.html]
module.s3_website.aws_s3_bucket_object.index: Refreshing state... [id=index.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.api_gateway.aws_api_gateway_deployment.api_deployment will be created
  + resource "aws_api_gateway_deployment" "api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "4ml0u9l3pg"
      + stage_name    = "dev"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_email_integration will be created
  + resource "aws_api_gateway_integration" "post_send_email_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/json" = jsonencode(
                {
                  + Message  = "$util.escapeJavaScript($input.body)"
                  + TopicArn = "arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-email-topic"
                }
            )
        }
      + resource_id             = "066h1y"
      + rest_api_id             = "4ml0u9l3pg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_push_integration will be created
  + resource "aws_api_gateway_integration" "post_send_push_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/json" = jsonencode(
                {
                  + Message  = "$util.escapeJavaScript($input.body)"
                  + TopicArn = "arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-push-topic"
                }
            )
        }
      + resource_id             = "vtykov"
      + rest_api_id             = "4ml0u9l3pg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_sms_integration will be created
  + resource "aws_api_gateway_integration" "post_send_sms_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/json" = jsonencode(
                {
                  + Message  = "$util.escapeJavaScript($input.body)"
                  + TopicArn = "arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-sms-topic"
                }
            )
        }
      + resource_id             = "rvbz48"
      + rest_api_id             = "4ml0u9l3pg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.iam.aws_iam_policy_attachment.lambda_basic_execution will be destroyed
  # (because aws_iam_policy_attachment.lambda_basic_execution is not in configuration)
  - resource "aws_iam_policy_attachment" "lambda_basic_execution" {
      - groups     = [] -> null
      - id         = "aws-notification-platform-dev-lambda-basic-execution" -> null
      - name       = "aws-notification-platform-dev-lambda-basic-execution" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - roles      = [
          - "aws-notification-platform-dev-lambda-role",
        ] -> null
      - users      = [] -> null
    }

  # module.iam.aws_iam_role.lambda_role will be destroyed
  # (because aws_iam_role.lambda_role is not in configuration)
  - resource "aws_iam_role" "lambda_role" {
      - arn                   = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-lambda-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-02-06T00:27:51Z" -> null
      - force_detach_policies = false -> null
      - id                    = "aws-notification-platform-dev-lambda-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "aws-notification-platform-dev-lambda-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATVKLQYALPTDQ3YTWD" -> null
        # (3 unchanged attributes hidden)
    }

  # module.iam_api_sns.aws_iam_role.apigateway_sns_role will be created
  + resource "aws_iam_role" "apigateway_sns_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-notification-platform-dev-apigateway-sns-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_lambda.aws_iam_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + name       = "aws-notification-platform-dev-lambda-basic-execution"
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + roles      = [
          + "aws-notification-platform-dev-lambda-role",
        ]
    }

  # module.iam_lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-notification-platform-dev-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_email.aws_lambda_function.email_lambda will be updated in-place
  ~ resource "aws_lambda_function" "email_lambda" {
        id                             = "aws-notification-platform-dev-email"
      ~ role                           = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-lambda-role" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_push.aws_lambda_function.push_lambda will be updated in-place
  ~ resource "aws_lambda_function" "push_lambda" {
        id                             = "aws-notification-platform-dev-push"
      ~ role                           = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-lambda-role" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_sms.aws_lambda_function.sms_lambda will be updated in-place
  ~ resource "aws_lambda_function" "sms_lambda" {
        id                             = "aws-notification-platform-dev-sms"
      ~ role                           = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-lambda-role" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 7 to add, 3 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.api_gateway.aws_api_gateway_deployment.api_deployment,
  on modules/api_gateway/main.tf line 114, in resource "aws_api_gateway_deployment" "api_deployment":
 114:   stage_name  = var.environment

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.

(and 8 more similar warnings elsewhere)

Warning: Deprecated Resource

  with module.s3_website.aws_s3_bucket_object.index,
  on modules/s3_website/main.tf line 15, in resource "aws_s3_bucket_object" "index":
  15: resource "aws_s3_bucket_object" "index" {

use the aws_s3_object resource instead

(and 3 more similar warnings elsewhere)

Warning: Deprecated attribute

  on modules/s3_website/outputs.tf line 6, in output "website_url":
   6:   value       = aws_s3_bucket.website_bucket.website_endpoint

The attribute "website_endpoint" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Dubovsky-Andrey, Action: `pull_request`*